
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.osborn_ws.cloudflare_record.CAA_issue[0] must be replaced
-/+ resource "cloudflare_record" "CAA_issue" {
      + allow_overwrite = false
      ~ created_on      = "2019-06-12T01:16:09.297495Z" -> (known after apply)
      ~ hostname        = "osborn.ws" -> (known after apply)
      ~ id              = "43522d4d4429f8eb21b1987bd208c9ec" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2019-06-12T01:16:09.297495Z" -> (known after apply)
      ~ name            = "osborn.ws" -> "9604afb13b752060f06de17d020a387e" # forces replacement
      - priority        = 0 -> null
      ~ proxiable       = false -> (known after apply)
      - proxied         = false -> null
      ~ ttl             = 1 -> (known after apply)
      ~ value           = "0 issue \comodoca.com\" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ data {
          - algorithm      = 0 -> null
          - altitude       = 0 -> null
          - digest_type    = 0 -> null
          - key_tag        = 0 -> null
          - lat_degrees    = 0 -> null
          - lat_minutes    = 0 -> null
          - lat_seconds    = 0 -> null
          - long_degrees   = 0 -> null
          - long_minutes   = 0 -> null
          - long_seconds   = 0 -> null
          - matching_type  = 0 -> null
          - order          = 0 -> null
          - port           = 0 -> null
          - precision_horz = 0 -> null
          - precision_vert = 0 -> null
          - preference     = 0 -> null
          - priority       = 0 -> null
          - protocol       = 0 -> null
          - selector       = 0 -> null
          - size           = 0 -> null
          - type           = 0 -> null
          - usage          = 0 -> null
          - weight         = 0 -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.osborn_ws.cloudflare_record.CAA_issue[1] must be replaced
-/+ resource "cloudflare_record" "CAA_issue" {
      + allow_overwrite = false
      ~ created_on      = "2019-06-12T01:16:09.495226Z" -> (known after apply)
      ~ hostname        = "osborn.ws" -> (known after apply)
      ~ id              = "ac9ab4cdaa7dde9afbf52e373eaecce8" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2019-06-12T01:16:09.495226Z" -> (known after apply)
      ~ name            = "osborn.ws" -> "9604afb13b752060f06de17d020a387e" # forces replacement
      - priority        = 0 -> null
      ~ proxiable       = false -> (known after apply)
      - proxied         = false -> null
      ~ ttl             = 1 -> (known after apply)
      ~ value           = "0 issue \digicert.com\" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ data {
          - algorithm      = 0 -> null
          - altitude       = 0 -> null
          - digest_type    = 0 -> null
          - key_tag        = 0 -> null
          - lat_degrees    = 0 -> null
          - lat_minutes    = 0 -> null
          - lat_seconds    = 0 -> null
          - long_degrees   = 0 -> null
          - long_minutes   = 0 -> null
          - long_seconds   = 0 -> null
          - matching_type  = 0 -> null
          - order          = 0 -> null
          - port           = 0 -> null
          - precision_horz = 0 -> null
          - precision_vert = 0 -> null
          - preference     = 0 -> null
          - priority       = 0 -> null
          - protocol       = 0 -> null
          - selector       = 0 -> null
          - size           = 0 -> null
          - type           = 0 -> null
          - usage          = 0 -> null
          - weight         = 0 -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.osborn_ws.cloudflare_record.CAA_issue[2] must be replaced
-/+ resource "cloudflare_record" "CAA_issue" {
      + allow_overwrite = false
      ~ created_on      = "2020-08-01T08:13:54.829104Z" -> (known after apply)
      ~ hostname        = "osborn.ws" -> (known after apply)
      ~ id              = "26ce6d19e966c0e65a3666b19605b40f" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2020-08-01T08:13:54.829104Z" -> (known after apply)
      ~ name            = "osborn.ws" -> "9604afb13b752060f06de17d020a387e" # forces replacement
      - priority        = 0 -> null
      ~ proxiable       = false -> (known after apply)
      - proxied         = false -> null
      ~ ttl             = 1 -> (known after apply)
      ~ value           = "0 issue \letsencrypt.org\" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ data {
          - algorithm      = 0 -> null
          - altitude       = 0 -> null
          - digest_type    = 0 -> null
          - key_tag        = 0 -> null
          - lat_degrees    = 0 -> null
          - lat_minutes    = 0 -> null
          - lat_seconds    = 0 -> null
          - long_degrees   = 0 -> null
          - long_minutes   = 0 -> null
          - long_seconds   = 0 -> null
          - matching_type  = 0 -> null
          - order          = 0 -> null
          - port           = 0 -> null
          - precision_horz = 0 -> null
          - precision_vert = 0 -> null
          - preference     = 0 -> null
          - priority       = 0 -> null
          - protocol       = 0 -> null
          - selector       = 0 -> null
          - size           = 0 -> null
          - type           = 0 -> null
          - usage          = 0 -> null
          - weight         = 0 -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.osborn_ws.cloudflare_record.domainkey_google_TXT must be replaced
-/+ resource "cloudflare_record" "domainkey_google_TXT" {
      + allow_overwrite = false
      ~ created_on      = "2020-08-01T08:15:15.357821Z" -> (known after apply)
      ~ hostname        = "google._domainkey.osborn.ws" -> (known after apply)
      ~ id              = "88e8a5251ce8c2d87621656a549940ad" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2020-08-01T08:15:15.357821Z" -> (known after apply)
      ~ name            = "google._domainkey.osborn.ws" -> "google._domainkey.9604afb13b752060f06de17d020a387e" # forces replacement
      - priority        = 0 -> null
      ~ proxiable       = false -> (known after apply)
      - proxied         = false -> null
      ~ ttl             = 1 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  - terraform_bucket_id = "terraform-20190402041657780700000001" -> null
